class BookData {
  static get title => book1['Title'];
  static get author => book1['Author'];
  static get chapter1Title => book1['Chapter 1 Title'];
  static get chapter1Body => book1['Chapter 1 Body'];
  static get chapter2Title => book1['Chapter 2 Title'];
  static get chapter2Body => book1['Chapter 2 Body'];
  static get chapter3Title => book1['Chapter 3 Title'];
  static get chapter3Body => book1['Chapter 3 Body'];

  static const book1 = {
    'Title': 'こころ',
    'Author': '夏目漱石',
    'Chapter 1 Title': '上　先生と私',
    'Chapter 1 Body':
        '''　私はその人を常に先生と呼んでいた。だからここでもただ先生と書くだけで本名は打ち明けない。これは世間を憚かる遠慮というよりも、その方が私にとって自然だからである。私はその人の記憶を呼び起すごとに、すぐ「先生」といいたくなる。筆を執っても心持は同じ事である。よそよそしい頭文字などはとても使う気にならない。
　私が先生と知り合いになったのは鎌倉である。その時私はまだ若々しい書生であった。暑中休暇を利用して海水浴に行った友達からぜひ来いという端書を受け取ったので、私は多少の金を工面して、出掛ける事にした。私は金の工面に二、三日を費やした。ところが私が鎌倉に着いて三日と経たないうちに、私を呼び寄せた友達は、急に国元から帰れという電報を受け取った。電報には母が病気だからと断ってあったけれども友達はそれを信じなかった。友達はかねてから国元にいる親たちに勧まない結婚を強いられていた。彼は現代の習慣からいうと結婚するにはあまり年が若過ぎた。それに肝心の当人が気に入らなかった。それで夏休みに当然帰るべきところを、わざと避けて東京の近くで遊んでいたのである。彼は電報を私に見せてどうしようと相談をした。私にはどうしていいか分らなかった。けれども実際彼の母が病気であるとすれば彼は固より帰るべきはずであった。それで彼はとうとう帰る事になった。せっかく来た私は一人取り残された。
　学校の授業が始まるにはまだ大分日数があるので鎌倉におってもよし、帰ってもよいという境遇にいた私は、当分元の宿に留まる覚悟をした。友達は中国のある資産家の息子で金に不自由のない男であったけれども、学校が学校なのと年が年なので、生活の程度は私とそう変りもしなかった。したがって一人ぼっちになった私は別に恰好な宿を探す面倒ももたなかったのである。
　宿は鎌倉でも辺鄙な方角にあった。玉突きだのアイスクリームだのというハイカラなものには長い畷を一つ越さなければ手が届かなかった。車で行っても二十銭は取られた。けれども個人の別荘はそこここにいくつでも建てられていた。それに海へはごく近いので海水浴をやるには至極便利な地位を占めていた。
　私は毎日海へはいりに出掛けた。古い燻ぶり返った藁葺の間を通り抜けて磯へ下りると、この辺にこれほどの都会人種が住んでいるかと思うほど、避暑に来た男や女で砂の上が動いていた。ある時は海の中が銭湯のように黒い頭でごちゃごちゃしている事もあった。その中に知った人を一人ももたない私も、こういう賑やかな景色の中に裹まれて、砂の上に寝そべってみたり、膝頭を波に打たしてそこいらを跳ね廻るのは愉快であった。
　私は実に先生をこの雑沓の間に見付け出したのである。その時海岸には掛茶屋が二軒あった。私はふとした機会からその一軒の方に行き慣れていた。長谷辺に大きな別荘を構えている人と違って、各自に専有の着換場を拵えていないここいらの避暑客には、ぜひともこうした共同着換所といった風なものが必要なのであった。彼らはここで茶を飲み、ここで休息する外に、ここで海水着を洗濯させたり、ここで鹹はゆい身体を清めたり、ここへ帽子や傘を預けたりするのである。海水着を持たない私にも持物を盗まれる恐れはあったので、私は海へはいるたびにその茶屋へ一切を脱ぎ棄てる事にしていた。
''',
    'Chapter 2 Title': '中　両親と私',
    'Chapter 2 Body': '''　宅へ帰って案外に思ったのは、父の元気がこの前見た時と大して変っていない事であった。
「ああ帰ったかい。そうか、それでも卒業ができてまあ結構だった。ちょっとお待ち、今顔を洗って来るから」
　父は庭へ出て何かしていたところであった。古い麦藁帽の後ろへ、日除のために括り付けた薄汚ないハンケチをひらひらさせながら、井戸のある裏手の方へ廻って行った。
　学校を卒業するのを普通の人間として当然のように考えていた私は、それを予期以上に喜んでくれる父の前に恐縮した。
「卒業ができてまあ結構だ」
　父はこの言葉を何遍も繰り返した。私は心のうちでこの父の喜びと、卒業式のあった晩先生の家の食卓で、「お目出とう」といわれた時の先生の顔付とを比較した。私には口で祝ってくれながら、腹の底でけなしている先生の方が、それほどにもないものを珍しそうに嬉しがる父よりも、かえって高尚に見えた。私はしまいに父の無知から出る田舎臭いところに不快を感じ出した。
「大学ぐらい卒業したって、それほど結構でもありません。卒業するものは毎年何百人だってあります」
　私はついにこんな口の利きようをした。すると父が変な顔をした。
「何も卒業したから結構とばかりいうんじゃない。そりゃ卒業は結構に違いないが、おれのいうのはもう少し意味があるんだ。それがお前に解っていてくれさえすれば、……」
　私は父からその後を聞こうとした。父は話したくなさそうであったが、とうとうこういった。
「つまり、おれが結構という事になるのさ。おれはお前の知ってる通りの病気だろう。去年の冬お前に会った時、ことによるともう三月か四月ぐらいなものだろうと思っていたのさ。それがどういう仕合せか、今日までこうしている。起居に不自由なくこうしている。そこへお前が卒業してくれた。だから嬉しいのさ。せっかく丹精した息子が、自分のいなくなった後で卒業してくれるよりも、丈夫なうちに学校を出てくれる方が親の身になれば嬉しいだろうじゃないか。大きな考えをもっているお前から見たら、高が大学を卒業したぐらいで、結構だ結構だといわれるのは余り面白くもないだろう。しかしおれの方から見てご覧、立場が少し違っているよ。つまり卒業はお前に取ってより、このおれに取って結構なんだ。解ったかい」
　私は一言もなかった。詫まる以上に恐縮して俯向いていた。父は平気なうちに自分の死を覚悟していたものとみえる。しかも私の卒業する前に死ぬだろうと思い定めていたとみえる。その卒業が父の心にどのくらい響くかも考えずにいた私は全く愚かものであった。私は鞄の中から卒業証書を取り出して、それを大事そうに父と母に見せた。証書は何かに圧し潰されて、元の形を失っていた。父はそれを鄭寧に伸した。
「こんなものは巻いたなり手に持って来るものだ」
「中に心でも入れると好かったのに」と母も傍から注意した。
　父はしばらくそれを眺めた後、起って床の間の所へ行って、誰の目にもすぐはいるような正面へ証書を置いた。いつもの私ならすぐ何とかいうはずであったが、その時の私はまるで平生と違っていた。父や母に対して少しも逆らう気が起らなかった。私はだまって父の為すがままに任せておいた。一旦癖のついた鳥の子紙の証書は、なかなか父の自由にならなかった。適当な位置に置かれるや否や、すぐ己れに自然な勢いを得て倒れようとした。''',
    'Chapter 3 Title': '下　先生と遺書',
    'Chapter 3 Body':
        '''「……私はこの夏あなたから二、三度手紙を受け取りました。東京で相当の地位を得たいから宜しく頼むと書いてあったのは、たしか二度目に手に入ったものと記憶しています。私はそれを読んだ時何とかしたいと思ったのです。少なくとも返事を上げなければ済まんとは考えたのです。しかし自白すると、私はあなたの依頼に対して、まるで努力をしなかったのです。ご承知の通り、交際区域の狭いというよりも、世の中にたった一人で暮しているといった方が適切なくらいの私には、そういう努力をあえてする余地が全くないのです。しかしそれは問題ではありません。実をいうと、私はこの自分をどうすれば好いのかと思い煩っていたところなのです。このまま人間の中に取り残されたミイラのように存在して行こうか、それとも……その時分の私は「それとも」という言葉を心のうちで繰り返すたびにぞっとしました。馳足で絶壁の端まで来て、急に底の見えない谷を覗き込んだ人のように。私は卑怯でした。そうして多くの卑怯な人と同じ程度において煩悶したのです。遺憾ながら、その時の私には、あなたというものがほとんど存在していなかったといっても誇張ではありません。一歩進めていうと、あなたの地位、あなたの糊口の資、そんなものは私にとってまるで無意味なのでした。どうでも構わなかったのです。私はそれどころの騒ぎでなかったのです。私は状差へあなたの手紙を差したなり、依然として腕組をして考え込んでいました。宅に相応の財産があるものが、何を苦しんで、卒業するかしないのに、地位地位といって藻掻き廻るのか。私はむしろ苦々しい気分で、遠くにいるあなたにこんな一瞥を与えただけでした。私は返事を上げなければ済まないあなたに対して、言訳のためにこんな事を打ち明けるのです。あなたを怒らすためにわざと無躾な言葉を弄するのではありません。私の本意は後をご覧になればよく解る事と信じます。とにかく私は何とか挨拶すべきところを黙っていたのですから、私はこの怠慢の罪をあなたの前に謝したいと思います。
　その後私はあなたに電報を打ちました。有体にいえば、あの時私はちょっとあなたに会いたかったのです。それからあなたの希望通り私の過去をあなたのために物語りたかったのです。あなたは返電を掛けて、今東京へは出られないと断って来ましたが、私は失望して永らくあの電報を眺めていました。あなたも電報だけでは気が済まなかったとみえて、また後から長い手紙を寄こしてくれたので、あなたの出京できない事情がよく解りました。私はあなたを失礼な男だとも何とも思う訳がありません。あなたの大事なお父さんの病気をそっち退けにして、何であなたが宅を空けられるものですか。そのお父さんの生死を忘れているような私の態度こそ不都合です。――私は実際あの電報を打つ時に、あなたのお父さんの事を忘れていたのです。そのくせあなたが東京にいる頃には、難症だからよく注意しなくってはいけないと、あれほど忠告したのは私ですのに。私はこういう矛盾な人間なのです。あるいは私の脳髄よりも、私の過去が私を圧迫する結果こんな矛盾な人間に私を変化させるのかも知れません。私はこの点においても充分私の我を認めています。あなたに許してもらわなくてはなりません。
　あなたの手紙、――あなたから来た最後の手紙――を読んだ時、私は悪い事をしたと思いました。それでその意味の返事を出そうかと考えて、筆を執りかけましたが、一行も書かずに已めました。どうせ書くなら、この手紙を書いて上げたかったから、そうしてこの手紙を書くにはまだ時機が少し早過ぎたから、已めにしたのです。私がただ来るに及ばないという簡単な電報を再び打ったのは、それがためです。''',
  };
}
